app/controllers/holdings_controller.rb

  def create
  	@holding = Holding.new(holding_params)
  	if @holding.save
---
INSERT INTO "holdings" ("address", "description", "city", "state", "zip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["address", "cccc"], ["description", "c"], ["city", "c"], ["state", "cc"], ["zip", "c"], ["created_at", "2018-07-15 19:34:19.992629"], ["updated_at", "2018-07-15 19:34:19.992629"]]

  def show
  	@holding = Holding.find(params[:id])
---
SELECT  "holdings".* FROM "holdings" WHERE "holdings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def index
  	@holdings = Holding.all
---
SELECT "holdings".* FROM "holdings"

  def edit
  	@holding = Holding.find(params[:id])
---
SELECT  "holdings".* FROM "holdings" WHERE "holdings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
  	@holding = Holding.find(params[:id])
  	if @holding.update(holding_params)
---
SELECT  "holdings".* FROM "holdings" WHERE "holdings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "holdings" SET "address" = $1, "updated_at" = $2 WHERE "holdings"."id" = $3  [["address", "3628 W. Cortez St"], ["updated_at", "2018-07-16 19:59:23.570976"], ["id", 4]]

  def destroy
  	@holding = Holding.find(params[:id])
  	@holding.destroy
---
SELECT  "holdings".* FROM "holdings" WHERE "holdings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "holdings" WHERE "holdings"."id" = $1  [["id", 1]]