app/controllers/leases_controller.rb

SELECT  "holdings".* FROM "holdings" WHERE "holdings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "leases" ("holding_id", "rent", "start_date", "end_date", "security_deposit", "conditions", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		@holding = Holding.find(params[:holding_id])
		@lease = @holding.leases.create(lease_params)

SELECT "leases".* FROM "leases"
---
	def index
		@leases = Lease.all

SELECT  "leases".* FROM "leases" WHERE "leases"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
	def show
		@lease = Lease.find(params[:id])

SELECT  "leases".* FROM "leases" WHERE "leases"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "leases" WHERE "leases"."id" = $1  [["id", 8]]
---
	def destroy
  	@lease = Lease.find(params[:id])
  	@lease.destroy